README.html
---
title: "Aqeel Akber personal website"
date: 2024-09-16
lastmod: 
layout: post
categories: 
tags: 
published: true
comments: 
---
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org94895e8">1. Making your own blog and contributing</a></li>
<li><a href="#org2b31cf6">2. Generated with Jekyll</a></li>
<li><a href="#org6b4fa47">3. Commit Transparency</a></li>
<li><a href="#orgdbef155">4. Org files</a></li>
</ul>
</div>
</div>
<p>
I first made this website in 2016. I took it down in 2018. I am now bringing it
back up in 2024. I am at a new point of life and can focus on my personal brand
again. I simply need a blog to start with. This one works. See
<a href="https://aqeelakber.com">https://aqeelakber.com</a>.
</p>

<p>
I wrote this website for mobile first with a KISS philosophy from scratch. I
wanted to see how beautiful of a reading experience I can create for the reader
with nothing but the basics.
</p>

<p>
You will find the code for this website is very basic indeed. Just standard
HTML, CSS, JavaScript. This was my challenge. A reduced pallete. I try to fit as
much goodness and joy out of it as possible.
</p>

<p>
I have put little to no effort into optimising it for performance. I wanted the
reader to be able to right click, view source, and be able to understand what I
did if they wanted. Teaching / Sharing / Learning are part of what I want this
website to instill. Because it is so basic, and honestly it&rsquo;s my personal blog
so I don&rsquo;t get much traffic, I&rsquo;m not concerned about the performance hit of
serving comments in my code to the user.
</p>

<p>
Visual design inspired by minimalism, scientific journal articles, and
originally by <a href="https://colah.github.io">https://colah.github.io</a>
</p>

<p>
The user experience is designed for comfortable reading like a book and app like
familiarity.
</p>
<div id="outline-container-org94895e8" class="outline-2">
<h2 id="org94895e8"><span class="section-number-2">1.</span> Making your own blog and contributing</h2>
<div class="outline-text-2" id="text-1">
<p>
Feel free to fork, you will want to delete everything in [BROKEN LINK: _posts] and [BROKEN LINK: blog] and
fill it in with your own content.
</p>

<p>
Once you&rsquo;re up and running, I would appreciate a backlink or shoutout if you can
and please let me know about your blog!
</p>
</div>
</div>
<div id="outline-container-org2b31cf6" class="outline-2">
<h2 id="org2b31cf6"><span class="section-number-2">2.</span> Generated with Jekyll</h2>
<div class="outline-text-2" id="text-2">
<p>
This website is compiled with Jekyll. I like it. It&rsquo;s dead simple. Perfect for
this project.
</p>
</div>
</div>
<div id="outline-container-org6b4fa47" class="outline-2">
<h2 id="org6b4fa47"><span class="section-number-2">3.</span> Commit Transparency</h2>
<div class="outline-text-2" id="text-3">
<p>
Hosting on GitHub provides transparency. You may observe the commit
history. Keep me honest.
</p>
</div>
</div>
<div id="outline-container-orgdbef155" class="outline-2">
<h2 id="orgdbef155"><span class="section-number-2">4.</span> Org files</h2>
<div class="outline-text-2" id="text-4">
<p>
I have always been an org user and now thanks to <a href="https://github.com/yoshinari-nomura/org-octopress">org-octopress</a> I can write my
blog posts in org too. The org source files are uploaded in [BROKEN LINK: blog].
</p>

<p>
Without content, a website is worthless. Integrating my org workflow has made it
mentally easier for me to generate more awesome content.
</p>
</div>
</div>
